Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: Let's go to Boston.
kw: Deun dhe Boston.

source: Let's go shopping.
kw: Gwren ni prenassa.

source: Let's do that.
kw: Gwren ni gul henna.

source: I want to run.
kw: My a vynn ponya.

source: I want to try.
kw: My a vynn assaya.

source: I want to play.
kw: My a vynn gwari.

source: I want to talk.
kw: My a vynn kewsel.

source: I want to walk.
kw: My a vynn kerdhes.

source: I want to work.
kw: My a vynn oberi.

source: I wanted to go.
kw: My a vynnas mos.

source: I want to watch.
kw: My a vynn mires orth.

source: We want to help.
kw: Ni a vynn gweres.

source: We want to know.
kw: Ni a vynn godhvos.

source: We want to talk.
kw: Ni a vynn kewsel.

source: I wanted to come.
kw: My a vynnas dos.

source: We want to leave.
kw: Ni a vynn diberth.

source: They want to help.
kw: I a vynn gweres.

source: They want to talk.
kw: I a vynn kewsel.

source: We wanted to wait.
kw: Ni a vynnas gortos.

source: I don't want to do that.
kw: Ny vynnav vy gul henna.

source: I don't want to play.
kw: Ny vynnav vy gwari.

source: I still want to know.
kw: My a vynn hwath godhvos.

source: We don't want to know.
kw: Ny vynnyn ni godhvos.

source: We still want to help.
kw: Ni a vynn hwath gweres.

source: Why do you want to go?
kw: Prag y fynn'ta mos?

source: I don't want to buy it.
kw: Ny vynnav vy y brena.

source: I don't want to forget.
kw: Ny vynnav vy ankevi.

source: I don't want to see it.
kw: Ny vynnav vy y weles.

source: Tom doesn't want to go.
kw: Ny vynn Tom mos.

source: I don't want to be here.
kw: Ny vynnav vy bos omma.

source: I don't want to do this.
kw: Ny vynnav vy gul hemma.

source: I don't want to go back.
kw: Ny vynnav vy mos arta.

source: I don't want to go home.
kw: Ny vynnav vy mos tre.

source: I don't want to see Tom.
kw: Ny vynnav vy gweles Tom.

source: Why do you want to know?
kw: Prag y fynn'ta godhvos?

source: I don't want to wait.
kw: Ny vynnav vy gortos.

source: I don't want to go there.
kw: Ny vynnav vy mos ena.

source: I don't want to lie down.
kw: Ny vynnav gorwedha.

source: I don't want to see that.
kw: Ny vynnav vy gweles henna.

source: I don't want to tell you.
kw: Ny vynnav vy leverel dhis.

source: We don't want to do that.
kw: Ny vynnyn ni gul henna.

source: We don't want to do this.
kw: Ny vynnyn ni gul hemma.

source: I don't want to hear that.
kw: Ny vynnav vy klewes henna.

source: I don't want to hear this.
kw: Ny vynnav vy klewes hemma.

source: I don't want to leave Tom.
kw: Ny vynnav vy diberth Tom.

source: I don't want to stay here.
kw: Ny vynnav vy gortos omma.

source: You don't want to do that.
kw: Ny vynn'ta gul henna.

source: You don't want to do this.
kw: Ny vynn'ta gul hemma.

source: I don't want to leave town.
kw: Ny vynnav vy diberth tre.

source: Why do you want to do that?
kw: Prag y fynn'ta gul henna?

source: Why do you want to see Tom?
kw: Prag y fynn'ta gweles Tom?

source: Why do you want to sell it?
kw: Prag y fynn'ta y wertha?

source: You don't want to go there.
kw: Ny vynn'ta mos ena.

source: I don't want to do anything.
kw: Ny vynnav vy gul tra vydh.

source: Why do you want to meet Tom?
kw: Prag y fynn'ta metya Tom?

source: Why do you want to know that?
kw: Prag y fynnydh y wodhvos?

source: Why do you want to work here?
kw: Prag y fynn'ta oberi omma?

source: I want to be in the other group.
kw: My a vynn bos y’n bagas aral.

source: She has a headache.
kw: Yma drog penn dhedhi.

source: I don't want to leave.
kw: Ny vynnav vy diberth.

source: I don't want to remember.
kw: Ny vynnav vy perthi kov.

source: I still want to talk to you.
kw: My a vynn hwath kewsel orthis.

source: I still want to see you tomorrow.
kw: My a vynn hwath dha weles a-vorow.

source: Is this news true?
kw: Yw an nowodhow ma gwir?

source: You must tell me.
kw: Res yw dhis leverel dhymm.

source: We're happy.
kw: Lowen on ni.

source: They liked big cars.
kw: Da o gansa kerri bras.

source: You're a beautiful woman.
kw: Benyn deg os.

source: Those flowers are beautiful.
kw: An bleujyow na yw teg.

source: I was playing here.
kw: Yth esen vy ow kwari omma.

source: I used to play here.
kw: My a wre gwari omma.

source: Is this your house?
kw: Yw hemma dha ji?

source: No smoking.
kw: Megi difennys.

source: Thanks.
kw: Meur ras.

source: Do you remember this?
kw: Eus kov dhis a hemma?

source: You must eat something.
kw: Res yw dhis dybri neppyth.

source: Where is the hospital?
kw: Ple'ma an klavji?

source: I need to get something.
kw: Res yw dhymm kavos neppyth.

source: I need to say something.
kw: Res yw dhymm leverel neppyth.

source: I'm twelve years old.
kw: Dewdhek bloodh ov.

source: I'm twelve.
kw: Dewdhek bloodh ov.

source: The cupboard is near the fridge.
kw: Yma'n amari ryb an yeynel.

source: He isn't hungry.
kw: Nyns yw gwag.

source: Why do you want to learn French?
kw: Prag y fynn'ta dyski Frynkek?

source: Who?
kw: Piw?

source: I'm thirty-four.
kw: Peswardhek bloodh warn ugens ov.

source: I need to lie down.
kw: Res yw dhymm gorwedha.

source: No one was in the room.
kw: Nyns esa den vyth y’n stevel.

source: Nobody knows his name.
kw: Ny wor den vyth y hanow.

source: The water was too hot yesterday.
kw: An dowr o re domm de.

source: I had to tell somebody.
kw: Res o dhymm leverel nebonan.

source: I have to tell someone.
kw: Res yw dhymm leverel nebonan.

source: Is this enough?
kw: Yw hemma lowr?

source: They liked to play in the snow.
kw: Da o gansa gwari y'n ergh.

source: I'm not your enemy.
kw: Nyns ov dha eskar.

source: Tom's strong.
kw: Krev yw Tom.

source: Tom's wounded.
kw: Goliys yw Tom.

source: We remember.
kw: Yma kov dhyn.

source: We waited.
kw: Ni a wortas.

source: Tom waited.
kw: Tom a wortas.

source: Tom knows.
kw: Tom a wor.

source: They're waiting.
kw: Yth esons i ow kortos.

source: They're trying.
kw: Yth esons i owth assaya.

source: They're surprised.
kw: Yma marth dhehda.

source: They're leaving.
kw: Yth esons i ow tiberth.

source: They're going.
kw: Yth esons i ow mos.

source: They're dancing.
kw: Yth esons i ow tonsya.

source: They waited.
kw: I a wortas.

source: They lied.
kw: I a leveris gow.

source: They left.
kw: I a dhibarthas.

source: That's beautiful.
kw: Teg yw henna.

source: Tell Tom.
kw: Lavar Tom.

source: Stay here.
kw: Gorta omma.

source: Someone's singing.
kw: Yma nebonen ow kana.

source: Say something.
kw: Lavar neppyth.

source: I'm working.
kw: Yth esov vy owth oberi.

source: I'm waiting.
kw: Yth esov vy ow kortos.

source: I'm trying.
kw: Yth esov vy owth assaya.

source: I'm staying.
kw: Yth esov vy ow kortos.

source: I see.
kw: My a wel.

source: I remember.
kw: Yma kov dhymm.

source: Come quickly!
kw: Deus yn uskis!

source: I've been waiting for you.
kw: My re bia ow kortos ragos.

source: It snowed yesterday.
kw: Hi a wrug ergh de.

source: We're trying.
kw: Yth eson ni owth assaya.

source: I waited.
kw: My a wortas.

source: She didn't need to go to the meeting.
kw: Nyns o res dhedhi mos dhe'n kuntelles.

source: She needs to come.
kw: Res yw dhedhi dos.

source: I need to go.
kw: Res yw dhymm mos.

source: I must go.
kw: Res yw dhymm mos.

source: I've seen the dog.
kw: My re welas an ki.

source: Where is she?
kw: Ple’ma hi?

source: We need to win.
kw: Res yw dhyn gwaynya.

source: I must hurry.
kw: Res yw dhymm fistena.

source: I ran outside.
kw: My a bonyas yn-mes.

source: The book is on the table.
kw: Yma an lyver war an voos.

source: You must go to school.
kw: Res yw dhis mos dhe’n skol.

source: I like to read.
kw: Da yw genev redya.

source: Is this my passport?
kw: Yw hemma ow thremengummyas?

source: He's crying.
kw: Yma va owth ola.

source: Is that sweet?
kw: Yw henna hweg?

source: That book is old.
kw: Koth yw an lyver na.

source: I need to do this.
kw: Res yw dhymm gul hemma.

source: You need to do this.
kw: Res yw dhis gul hemma.

source: I have to work tomorrow.
kw: Res yw dhymm oberi a-vorow.

source: He left early.
kw: Ev a dhibarthas a-varr.

source: She left early.
kw: Hi a dhibarthas a-varr.

source: I am not hungry.
kw: Nyns eus nown dhymm.

source: Is that your sister?
kw: Yw henna dha hwor?

source: Do you want to drink coffee?
kw: A vyn’ta eva koffi?

source: I was listening.
kw: Yth esen vy ow koslowes.

source: I was travelling.
kw: Yth esen vy ow viajya.

source: I was learning.
kw: Yth esen vy ow tyski.

source: I was singing.
kw: Yth esen vy ow kana.

source: She has three children.
kw: Yma tri flogh dhedhi.

source: We're cold.
kw: Yeyn on.

source: We're hungry.
kw: Yma nown dhyn.

source: I'm mean.
kw: Kraf ov.

source: I'm rich.
kw: Rych ov.

source: You're rich.
kw: Rych os ta.

source: We're sad.
kw: Trist on ni.

source: Tom is strong.
kw: Krev yw Tom.

source: We're surprised.
kw: Yma marth dhyn.

source: I'm surprised.
kw: Yma marth dhymm.

source: You're wealthy.
kw: Golusek os ta.

source: Tom is wounded.
kw: Goliys yw Tom.

source: We're buying.
kw: Yth eson ni ow prena.

source: I'm dancing.
kw: Yth esov vy ow tonsya.

source: We're dancing.
kw: Yth eson ni ow tonsya.

source: We're going.
kw: Yth eson ni ow mos.

source: Who's he?
kw: Piw yw ev?

source: We're reading.
kw: Yth eson ni ow redya.

source: Who's she?
kw: Piw yw hi?

source: I'm sleeping.
kw: Yth esov vy ow koska.

source: I'm speaking.
kw: Yth esov vy ow kewsel.

source: You're trying.
kw: Yth esos ta owth assaya.

source: Are you surprised?
kw: Eus marth dhis?

source: Is this your dog?
kw: Yw hemma dha gi?

source: Is this your cat?
kw: Yw homma dha gath?

source: She's old, ugly and fat.
kw: Koth, hager ha tew yw.

source: What kind of girl are you?
kw: Py par mowes os ta?

source: The boy was tired.
kw: Skwith o an maw.

source: This is big.
kw: Bras yw hemma.

source: This is good.
kw: Hemm yw da.

source: This is odd.
kw: Koynt yw hemma.

source: This is OK.
kw: Da lowr yw hemma.

source: This is strange.
kw: Koynt yw hemma.

source: This is sweet.
kw: Hweg yw hemma.

source: I hated Tom.
kw: Kas o genev Tom.

source: I like Tom.
kw: Da yw genev Tom.

source: I liked Tom.
kw: Da o genev Tom.

source: I'm Tom's mother.
kw: Mamm Tomm ov vy.

source: Tom didn't listen.
kw: Ny wrug Tom goslowes.

source: Tom didn't understand.
kw: Ny gonvedhas Tom.

source: Tom is wet.
kw: Glyb yw Tomm.

source: Tom knows that.
kw: Tomm a wor henna.

source: Tom saw her.
kw: Tomm a’s gwelas.

source: Tom saw him.
kw: Tomm a’n gwelas.

source: Tom saw it.
kw: Tomm a’n gwelas.

source: What colour is the bird?
kw: Py liw yw an edhen?

source: We considered that.
kw: Ni a brederis henna.

source: We could read.
kw: Ni a allas redya.

source: We could try.
kw: Ni a allas assaya.

source: We could wait.
kw: Ni a allas gortos.

source: We could walk.
kw: Ni a allas kerdhes.

source: We leave tonight.
kw: Ni a dhiberth haneth.

source: We must continue.
kw: Res yw dhyn pesya.

source: We must help.
kw: Res yw dhyn gweres.

source: We must hurry.
kw: Res yw dhyn fistena.

source: We must leave.
kw: Res yw dhyn diberth.

source: We must run.
kw: Res yw dhyn ponya.

source: We must speak.
kw: Res yw dhyn kewsel.

source: We must try.
kw: Res yw dhyn assaya.

source: We must wait.
kw: Res yw dhyn gortos.

source: They fixed it.
kw: I a’n ewnas.

source: They found Tom.
kw: I a gavas Tom.

source: They hate Tom.
kw: Kas yw gansa Tom.

source: They hate women.
kw: Kas yw gansa benenes.

source: They love Tom.
kw: I a gar Tom.

source: They must come.
kw: Res yw dhedha dos.

source: They ran outside.
kw: I a bonyas yn-mes.

source: They spoke French.
kw: I a gewsi Frynkek.

source: They weren't there.
kw: Nyns esens i ena.

source: They won't come.
kw: Ny vynnons dos.

source: They'll find us.
kw: I a vynn agan kavos.

source: They're not sure.
kw: Nyns yns sur.

source: Tom likes snow.
kw: Da yw gans Tom ergh.

source: Come to me.
kw: Deus dhymm.

source: Come to us.
kw: Deus dhyn.

source: I can't leave.
kw: Ny allav vy diberth.

source: I can't look.
kw: Ny allav vy mires.

source: I considered that.
kw: My a brederis henna.

source: I could help.
kw: My a allas gweres.

source: I could try.
kw: My a allas assaya.

source: I could walk.
kw: My a allas kerdhes.

source: I hate parties.
kw: Kas yw genev kevewiow.

source: I hate that.
kw: Kas yw genev henna.

source: I hate this.
kw: Kas yw genev hemma.

source: I like beer.
kw: Da yw genev korev.

source: I like blue.
kw: Da yw genev glas.

source: I like girls.
kw: Da yw genev mowesi.

source: I like this.
kw: Da yw genev hemma.

source: I like women.
kw: Da yw genev benenes.

source: I love Australia.
kw: My a gar Ostrali.

source: I must continue.
kw: Res yw dhymm pesya.

source: I must leave.
kw: Res yw dhymm diberth.

source: I must run.
kw: Res yw dhymm ponya.

source: I ran home.
kw: My a bonyas tre.

source: I need to know.
kw: Res yw dhymm godhvos.

source: It snowed last night.
kw: Hi a wrug ergh nyhewer.

source: I remember that.
kw: Yma kov dhymm a henna.

source: I was surprised.
kw: Yth esa marth dhymm.

source: I was working.
kw: Yth esen vy owth oberi.

source: I will stay.
kw: My a vynn triga.

source: I won't come.
kw: Ny vynnav dos.

source: I'm an accountant.
kw: Akontydh ov.

source: I'm not thirsty.
kw: Nyns eus seghes dhymm.

source: I've been drinking.
kw: My re bia owth eva.

source: I've been practicing.
kw: My re bia ow praktisya.

source: I've been waiting.
kw: My re bia ow kortos.

source: I've been watching.
kw: My re bia ow mires orth.

source: Is that coffee?
kw: Yw henna koffi?

source: Is that enough?
kw: Yw henna lowr?

source: Is that new?
kw: Yw henna nowydh?

source: Is this new?
kw: Yw hemma nowydh?

source: Is this OK?
kw: Yw hemma da lowr?

source: It was snowing.
kw: Yth esa hi ow kul ergh.

source: Look at us.
kw: Mir orthyn.

source: Open these doors.
kw: Ygor an darasow ma.

source: Please don't argue.
kw: Na wrewgh argya, mar pleg.

source: Please go ahead.
kw: Pes, my a’th pys.

source: Speak to me.
kw: Kows dhymm.

source: Talk to us.
kw: Kows dhyn.

source: That was beautiful.
kw: Teg o henna.

source: That's my brother.
kw: Ow broder yw henna.

source: That's my sister.
kw: Honn yw ow hwor.

source: That's old news.
kw: Henn yw nowodhow koth.

source: These are daisies.
kw: An re ma yw borelesyow.

source: These are good.
kw: An re ma yw da.

source: These are heavy.
kw: An re ma yw poos.

source: These are new.
kw: An re ma yw nowydh.

source: Do you like French wine?
kw: Yw da genes gwin frynkek?

source: Is there a TV in your bedroom?
kw: Eus pellwolok y’th chambour?

source: Where's my brother?
kw: Ple'ma ow broder?

source: Where's your phone?
kw: Ple’ma dha bellgowser?

source: You were at home yesterday.
kw: Yth eses tre de.

source: Who was it?
kw: Piw o?

source: You can't go.
kw: Ny yll'ta mos.

source: You can't leave.
kw: Ny yll'ta diberth.

source: You can't see.
kw: Ny yll'ta gweles.

source: You can't understand.
kw: Ny yll'ta konvedhes.

source: You could help.
kw: Ty a allas gweres.

source: You could run.
kw: Ty a allas ponya.

source: You could start.
kw: Ty a allas dalleth.

source: You could try.
kw: Ty a allas assaya.

source: You must come.
kw: Res yw dhis dos.

source: You must eat.
kw: Res yw dhis dybri.

source: You must hurry.
kw: Res yw dhis fistena.

source: You must listen.
kw: Res yw dhis goslowes.

source: You must return.
kw: Res yw dhis dehweles.

source: You must run.
kw: Res yw dhis ponya.

source: You must stop.
kw: Res yw dhis hedhi.

source: You must try.
kw: Res yw dhis assaya.

source: You weren't there.
kw: Nyns eses ta ena.

source: Where is the man?
kw: Ple'ma an den?

source: That's a lie.
kw: Henn yw gow.

source: Do you like his songs?
kw: Yw da genes y ganow?

source: Do you like these songs?
kw: Yw da genes an kanow ma?

source: Good morning.
kw: Myttin da!

source: It's about eleven o'clock.
kw: A-dro dhe unnek eur yw.

source: You can't do that!
kw: Ny yll'ta gul henna!

source: I prefer dogs.
kw: Gwell yw genev keun.

source: Don't you like Tom?
kw: A nyns yw da genes Tom?

source: I don't hate Tom.
kw: Nyns yw kas genev Tom.

source: I must find Tom.
kw: Res yw dhymm kavos Tom.

source: I must see Tom.
kw: Res yw dhymm gwelesTom.

source: The weather is terrible.
kw: Euthyk yw an gewer.

source: Do you understand French?
kw: A wre’ta convedhes Frynkek?

source: Good evening!
kw: Gorthuher da!

source: He died last year.
kw: Ev a verwis warleni.

source: The weather is very bad.
kw: Pur dhrog yw an gewer.

source: Don't you like cats?
kw: A ny gerydh kathes?

source: Don't you like parties?
kw: A nyns yw da genes kevewiow?

source: I didn't see that.
kw: Ny welis vy henna.

source: I don't hate this.
kw: Nyns yw kas genev hemma.

source: I won't forget this.
kw: Ny vynnav ankevi hemma.

source: They didn't like Tom.
kw: Nyns yw da gansa Tom.

source: Tom doesn't know that.
kw: Ny wor Tomm henna.

source: Tom doesn't remember Mary.
kw: Ny borth Tom kov a Varia.

source: Tom won't eat that.
kw: Ny vynn Tom dybri henna.

source: Tom has seen it.
kw: Tomm re’n gwelas.

source: We have to leave.
kw: Res yw dhyn diberth.

source: You have to help.
kw: Res yw dhis gweres.

source: You have to start.
kw: Res yw dhis dalleth.

source: You have to try.
kw: Res yw dhis assaya.

source: I don't want to sleep.
kw: Ny vynnav vy koska.

source: I don't need to know.
kw: Nyns yw res dhymm godhvos.

source: I hate the weather here.
kw: Kas yw genev an gewer omma.

source: They don't have to answer.
kw: Nyns yw res dhedha gorthebi.

source: I have to walk slowly.
kw: Res yw dhymm kerdhes yn lent.

source: I have to run.
kw: Res yw dhymm ponya.

source: I have to stop.
kw: Res yw dhymm hedhi.

source: I have to think.
kw: Res yw dhymm tybi.

source: We don't have a dog.
kw: Nyns eus ki dhyn.

source: I don't like this weather.
kw: Nyns yw da genev an gewer ma.

source: You didn't have to ask.
kw: Nyns o res dhis govyn.

source: You didn't have to leave.
kw: Nyns o res dhis diberth.

source: You didn't have to lie.
kw: Nyns o res dhis gowleverel.

source: You don't have to answer.
kw: Nyns yw res dhis gorthebi.

source: You don't have to come.
kw: Nyns yw res dhis dos.

source: You don't have to go.
kw: Nyns yw res dhis mos.

source: You don't have to lie.
kw: Nyns yw res dhis gowleverel.

source: You don't have to sing.
kw: Nyns yw res dhis kana.

source: You don't have to speak.
kw: Nyns yw res dhis kewsel.

source: You don't need to know.
kw: Nyns yw res dhis godhvos.

source: I'm driving.
kw: Yth esov vy ow lewya.

source: I didn't take anything.
kw: Ny gemeris tra vyth.

source: I drink.
kw: My a yv.

source: I sing.
kw: My a gan.

source: I don't like to run.
kw: Nyns yw da genev ponya.

source: I didn't have to do that.
kw: Nyns o res dhymm gul henna.

source: I didn't need to see that.
kw: Nyns o res dhymm gweles henna.

source: Is the weather beautiful?
kw: Yw an gewer teg?

source: I want to drink.
kw: My a vynn eva.

source: Do you like blue cheese?
kw: Yw da genes keus glas?

source: I'm writing a book.
kw: Yth esov vy ow skrifa lyver.

source: I like to drink milk.
kw: Da yw genev eva leth.

source: Where is the market?
kw: Ple'ma an varghas?

source: Do you like this?
kw: Yw da genes hemma?

source: The sun is a star.
kw: Steren yw an howl.

source: I can understand Tom.
kw: My a yll konvedhes Tomm.

source: I can't leave here.
kw: Ny allav vy diberth omma.

source: I left.
kw: My a dhibarthas.

source: I could do that.
kw: My a allas gul henna.

source: I could sell this.
kw: My a allas gwertha hemma.

source: I couldn't hear Tom.
kw: Ny yllyn klewes Tom.

source: Where is the food?
kw: Ple'ma an boos?

source: Where is the road?
kw: Ple'ma an fordh?

source: Where is the restaurant?
kw: Ple’ma’n bosti?

source: I don't have to listen to you.
kw: Nyns yw res dhymm goslowes orthis.

source: I don't want to drive.
kw: Ny vynnav vy lewya.

source: I had a headache.
kw: Yth esa drog penn dhymm.

source: I had to do it.
kw: Res o dhymm y wul.

source: I had to do this today.
kw: Res o dhymm gul hemma hedhyw.

source: I had to get something.
kw: Res o dhymm kavos neppyth.

source: I had to go back.
kw: Res o dhymm mos arta.

source: I had to go home.
kw: Res o dhymm mos tre.

source: I had to help Tom.
kw: Res o dhymm gweres Tom.

source: I had to see you.
kw: Res o dhymm dha weles.

source: I had to tell Tom.
kw: Res o dhymm leverel Tom.

source: I had to try something.
kw: Res o dhymm assaya neppyth.

source: I had to try.
kw: Res o dhymm assaya.

source: I had to work.
kw: Res o dhymm oberi.

source: I hate alarm clocks.
kw: Kas yw genev difunellow.

source: I hate my eyebrows.
kw: Kas yw genev ow abransow.

source: I hate my hair.
kw: Kas yw genev ow gols.

source: I hate that book.
kw: Kas yw genev an lyver na.

source: I hate that song.
kw: Kas yw genev an gan na.

source: I hate these things.
kw: Kas yw genev an traow ma.

source: I hate this car.
kw: Kas yw genev an karr ma.

source: I hate this carpet.
kw: Kas yw genev an leurlen ma.

source: I hate this music.
kw: Kas yw genev an ilow ma.

source: I hate this song.
kw: Kas yw genev an gan ma.

source: I hate this thing.
kw: Kas yw genev an dra ma.

source: I hate this town.
kw: Kas yw genev an dre ma.

source: I hate to wait.
kw: Kas yw genev gortos.

source: The sky was blue.
kw: Glas o an ebron.

source: He was looking at you.
kw: Yth esa ev ow mires orthis.

source: She was looking at you.
kw: Yth esa hi ow mires orthis.

source: He was looking at her.
kw: Yth esa ev ow mires orti.

source: She was looking at him.
kw: Yth esa hi ow mires orto.

source: Ruben has three sons.
kw: Yma dhe Ruben tri mab.

source: This is my computer.
kw: Hemm yw ow jynn-amontya.

source: The sky was grey.
kw: Loos o an ebron.

source: The sky was red.
kw: Rudh o an ebron.

source: He had a dog.
kw: Yth esa ki dhodho.

source: That is a lie.
kw: Henn yw gow.

source: Look at him.
kw: Mir orto.

source: I've been preparing.
kw: My re bia ow pareusi.

source: I've been studying French at school.
kw: My re bia ow studhya Frynkek orth skol.

source: I've been studying French.
kw: My re bia ow studhya Frynkek.

source: I've been waiting for this.
kw: My re bia ow kortos rag hemma.

source: I've never seen a rainbow.
kw: Bythkweth ny welis kammneves.

source: I haven't seen Tom.
kw: Ny welis Tomm.

source: I have to find my dog.
kw: Res yw dhymm kavos ow hi.

source: I have to go out.
kw: Res yw dhymm mos yn-mes.

source: I have to go there.
kw: Res yw dhymm mos ena.

source: I have to help.
kw: Res yw dhymm gweres.

source: I have to know now.
kw: Res yw dhymm godhvos lemmyn.

source: I have to know.
kw: Res yw dhymm godhvos.

source: I have to leave again.
kw: Res yw dhymm diberth arta.

source: I have to leave.
kw: Res yw dhymm diberth.

source: I have to work now.
kw: Res yw dhymm oberi lemmyn.

source: I have to work tonight.
kw: Res yw dhymm oberi haneth.

source: I don't remember that.
kw: Nyns eus kov dhymm a henna.

source: I need to feed the dog.
kw: Res yw dhymm maga an ki.

source: Good night.
kw: Nos da.

source: I love you!
kw: My a’th kar!

source: I know you're a friend of Tom's.
kw: My a wor dha vos koweth a Tom.

source: I like to be here.
kw: Da yw genev bos omma.

source: I like to read books.
kw: Da yw genev redya lyvrow.

source: I live here with my dog.
kw: Trigys ov vy gans ow hi.

source: I must find the answer.
kw: Res yw dhymm kavos an gorthyp.

source: I must go back.
kw: Res yw dhymm mos arta.

source: I must have this.
kw: Res yw dhymm kavos hemma.

source: I must leave here.
kw: Res yw dhymm diberth omma.

source: I must meet Tom.
kw: Res yw dhymm metya Tom.

source: I must say something.
kw: Res yw dhymm leverel neppyth.

source: I must see it.
kw: Res yw dhymm y weles.

source: I must speak with you.
kw: Res yw dhymm kewsel genes.

source: I must stay here.
kw: Res yw dhymm gortos omma.

source: I must talk with you.
kw: Res yw dhymm kewsel genes.
